// 智能排班系统全局配置文件
// 请将此文件与 HTML 文件放在同一目录下
window.appSettings = {
    "staffList": [
        "熊莉红",
        "张如贵",
        "林辉",
        "张丽媛",
        "张香玲",
        "吴佳伟",
        "涂冲",
        "黄伶俐",
        "王娇",
        "何超"
    ],
    "holidayStaffList": [
        "熊莉红",
        "张如贵",
        "林辉",
        "张丽媛",
        "张香玲",
        "吴佳伟",
        "涂冲",
        "黄伶俐",
        "王娇",
        "何超"
    ],
    "candidateStaffList": [
        "刘晓青",
        "胡晓飞"
    ],
    "scheduleConfig": {
        "holidays": [
            "2026-4-4",
            "2026-4-5",
            "2026-4-6",
            "2026-5-1",
            "2026-5-2",
            "2026-5-3",
            "2026-5-4",
            "2026-5-5",
            "2026-6-19",
            "2026-6-20",
            "2026-6-21",
            "2026-9-25",
            "2026-9-26",
            "2026-9-27",
            "2026-10-1",
            "2026-10-2",
            "2026-10-3",
            "2026-10-4",
            "2026-10-5",
            "2026-10-6",
            "2026-10-7"
        ],
        "monthStarts": {
            "2026-3": "熊莉红",
            "2026-4": "张如贵",
            "2026-5": "王娇",
            "2026-6": "张香玲",
            "2026-7": "张如贵",
            "2026-8": "林辉",
            "2026-9": "张丽媛",
            "2026-10": "熊莉红"
        },
        "holidayMonthStarts": {
            "2026-3": "熊莉红",
            "2026-4": "熊莉红",
            "2026-5": "林辉",
            "2026-6": "涂冲",
            "2026-7": "何超",
            "2026-8": "何超",
            "2026-9": "熊莉红",
            "2026-10": "林辉"
        },
        "overrides": {
            "2026-6-H2": {
                "type": "temp",
                "name": "何超"
            },
            "2026-10-H6": {
                "type": "temp",
                "name": "何超"
            }
        },
        "inserts": {
            "2026-4-4": "张香玲",
            "2026-5-1": "王娇",
            "2026-9-27": "王娇"
        }
    }
};