// 智能排班系统全局配置文件
// 请将此文件与 HTML 文件放在同一目录下
window.appSettings = {
    "staffList": [
        "熊莉红",
        "张如贵",
        "林辉",
        "张丽媛",
        "张香玲",
        "吴佳伟",
        "涂冲",
        "黄伶俐",
        "王娇",
        "何超"
    ],
    "holidayStaffList": [
        "熊莉红",
        "张如贵",
        "林辉",
        "张丽媛",
        "张香玲",
        "吴佳伟",
        "涂冲",
        "黄伶俐",
        "王娇",
        "何超"
    ],
    "candidateStaffList": [
        "刘晓青",
        "胡晓飞"
    ],
    "scheduleConfig": {
        "holidays": [
            "2026-4-4",
            "2026-4-5",
            "2026-4-6",
            "2026-5-1",
            "2026-5-2",
            "2026-5-3",
            "2026-5-4",
            "2026-5-5",
            "2026-6-19",
            "2026-6-20",
            "2026-6-21",
            "2026-9-25",
            "2026-9-26",
            "2026-9-27",
            "2026-10-1",
            "2026-10-2",
            "2026-10-3",
            "2026-10-4",
            "2026-10-5",
            "2026-10-6",
            "2026-10-7",
            "2026-1-1",
            "2026-1-2",
            "2026-1-3",
            "2026-2-15",
            "2026-2-16",
            "2026-2-17",
            "2026-2-18",
            "2026-2-19",
            "2026-2-20",
            "2026-2-21",
            "2026-2-22",
            "2026-2-23"
        ],
        "makeupWorkDays": [
            "2026-1-4",
            "2026-2-14",
            "2026-2-28",
            "2026-5-9",
            "2026-9-20",
            "2026-10-10"
        ],
        "summerTrainings": [],
        "closedVenues": [],
        "monthStarts": {
            "2026-3": "熊莉红",
            "2026-4": "张如贵",
            "2026-5": "王娇",
            "2026-6": "张香玲"
        },
        "holidayMonthStarts": {
            "2026-3": "熊莉红",
            "2026-4": "熊莉红",
            "2026-5": "林辉",
            "2026-6": "涂冲"
        },
        "overrides": {
            "2026-6-H2": {
                "type": "swap",
                "source": "2026-9-H0",
                "groupId": "G1773362623834"
            },
            "2026-9-H0": {
                "type": "swap",
                "source": "2026-9-H1",
                "groupId": "G1773362623834"
            },
            "2026-9-H1": {
                "type": "swap",
                "source": "2026-9-H2",
                "groupId": "G1773362623834"
            },
            "2026-9-H2": {
                "type": "swap",
                "source": "2026-6-H2",
                "groupId": "G1773362623834"
            },
            "2026-10-H6": {
                "type": "temp",
                "name": "何超"
            },
            "2026-4-H1": {
                "type": "temp",
                "name": "王娇"
            }
        },
        "inserts": {
            "2026-4-4": "张香玲",
            "2026-5-1": "张如贵"
        },
        "apiFetchedYears": [
            2026
        ]
    }
};